import { fetchBreeds } from "./cat-api";

fetchBreeds().then(result => console.log(result));

/*
1. отримати рефс

2. вішаємо слухач на форму change
отримати масив порід та записати в селект select.breed-select
поки йде запит порід, скрити select.breed-select і показати p.loader
зарендерити айді породи в значення 
3. отримати запит з інпуту та передати з нього у вигляді квері запит з айді котів на сервер
поки йде запит масиву котів, скрити  div.cat-info и показать p.loader
4. перевірити відподідь серверу, якщо негативна - повідомити користувача
5. отримаємо результат та перебираємо масив котів і створюємо розмітку в div.cat-info
6. рендеримо розмітку на веб іннером наприклад або?
7. обробити помилку в p.error і при списку порід і при пошуку котів по породі
8. прикрасити інтерфейс 
*/

const refs = {
    select: document.querySelector('.breed-select'),
}
